'''
一、
    dict = {"k1":"v1","k2":"v2","k3":"v3"}
    1、请循环遍历出所有的key
    2、请循环遍历出所有的value
    3、请在字典中增加一个键值对,"k4":"v4"
'''

# dict = {"k1":"v1","k2":"v2","k3":"v3"}
# 循环遍历出所有的key
# for key in dict:
#     print(key)
# 循环遍历出所有的value
# for value in dict.values():
#     print(value)
# 增加一个键值对,"k4":"v4"
# dict["k4"] = "v4"
# print(dict)


'''
二、
    小明去超市购买水果，账单如下
    苹果  32.8
    香蕉  22
    葡萄  15.5
    请将上面的数据存储到字典里，可以根据水果名称查询购买这个水果的费用
    用水果名称做key，金额做value，创建一个字典
'''

# info = {
#     '苹果':32.8,
#     '香蕉': 22,
#     '葡萄': 15.5
# }
# name = input("请输入要查询的水果名称：")
# if name == '苹果':
#     print("费用为：",info['苹果'])
# elif name == '香蕉':
#     print("费用为：", info['香蕉'])
# elif name == '葡萄':
#     print("费用为：", info['葡萄'])
# else:
#     print("输入的水果不存在！")


'''
三、
    小明，小刚去超市里购买水果
    小明购买了苹果，草莓，香蕉，小刚购买了葡萄，橘子，樱桃，请从下面的描述的字典中，计算每个人花费的金额，并写入到money字段里。
    以姓名做key，value仍然是字典
    Friuts = {
        ‘苹果’：12.3，  # 水果和单价
        ‘草莓’：4.5，
        ‘香蕉’：6.3，
        ‘葡萄’：5.8，
        ‘橘子’：6.4，
        ‘樱桃’：15.8
    }
    info = {
        '小明': {
            'fruits': {'苹果':4, '草莓':13, '香蕉':10},
            'money': ??
        },
        '小刚': {
            'fruits': {'葡萄':19, '橘子':12, '樱桃':30},
            'money': ??
        }
    }
'''

# info = {
#     '小明': {
#         'fruits': {'苹果':4, '草莓':13, '香蕉':10},
#         'money': ''
#     },
#     '小刚': {
#         'fruits': {'葡萄':19, '橘子':12, '樱桃':30},
#         'money':''
#     }
# }
# money1, money2 = 0, 0
# for value in info['小明']['fruits'].values():
#     money1 += value
# for value in info['小刚']['fruits'].values():
#     money2 += value
# info['小明']['money']=money1
# info['小刚']['money']=money2
# print(info)


'''
四、
    编写一个函数，传入一个列表，并统计每个数字出现的次数。返回字典数据：{21:3,56:9,10:3}   （阿里一轮笔试题）
'''

# info = [21, 21, 21, 56, 56, 56, 56, 56, 56, 56, 56, 56, 10, 10, 10]
# def count(info):
#     dict = {}
#     for i in info:
#         if i not in dict:
#             dict[i] = 1
#         else:
#             dict[i] += 1
#     return dict
# print(count(info))


'''
五、
    有以下公司员工信息，将数据转换为字典方式（姓名作为键，其他作为值,张三:{xxx:xxx,xx:xxx}）
    # 姓名  年龄  性别  编号   任职公司   薪资   部门编号
    names = [
        ["刘备","56","男","106","IBM", 500 ,"50"],
        ["大乔","19","女","230","微软", 501 ,"60"],
        ["小乔", "19", "女", "210", "Oracle", 600, "60"],
        ["张飞", "45", "男", "230", "Tencent", 700 , "10"]
    ]
'''

# names = [
#     ["刘备","56","男","106","IBM", 500 ,"50"],
#     ["大乔","19","女","230","微软", 501 ,"60"],
#     ["小乔", "19", "女", "210", "Oracle", 600, "60"],
#     ["张飞", "45", "男", "230", "Tencent", 700 , "10"]
# ]
#
# info = {}
# for i in names:
#     info[i[0]] = {
#             '年龄': i[1],
#             '性别': i[2],
#             '编号': i[3],
#             '任职公司': i[4],
#             '薪资': i[5],
#             '部门编号': i[6]
#         }
#
# print(info)
#




